import React from 'react';

const QuesAns = () => {
    return (
        <div className='my-5'>
            <div className='my-5'>
                <h2>প্রশ্নঃ রিয়েক্ট কিভাবে কাজ করে?</h2>
                    <p>আমরা সাধারণত ওয়েবসাইটে এইচটিএমএল, সিএসএস সহ জাভাস্ক্রিপ্ট ইউজ করি, আর রিঅ্যাক্ট একটা সেইম টু সেইম এই ব্রাউজারের ডমের মতো করে আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। এখন এই ডম দেখতে পুরো সেই আসল ডমের মতোই, কিন্তু এই ভার্চুয়াল ডমটা আসলে একটা জাভাস্ক্রিপ্ট অবজেক্ট। রিঅ্যাক্ট এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে সহজেই জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট কম সময়ের মধ্যে এবং এফিসিয়েন্টলি মডিফাই করা যায় ।
                    রিয়েক্ট সর্বদাই একমুখী ডেটা প্রবাহ করে থাকে। তার মানে, যখন একটি রিয়েক্ট অ্যাপ ডিজাইন করা হয়, তখন প্যারেন্ট ও চাইল্ড কম্পোনেন্টের মধ্যে কানেকশন তৈরী করে খুব সহজে প্রপ্স এর মাধ্যমে বাইডিরেকশনালি ডাটা চাইল্ড কম্পোনেটে পাঠানো যায়। </p>
            </div>
            <div>
                <h2>প্রশ্নঃ Props ও State এর মধ্যে পার্থক্য কি? </h2> 
                <div>
                <table class="table table-striped table-bordered border-primary">
                    <thead>
                        <tr>
                            <th scope="col">#</th>
                            <th scope="col">Props</th>
                            <th scope="col">State</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <th scope="row">1</th>
                            <td>Props এর  মাধ্যমে একটা কম্পোনেন্ট থেকে অন্য কম্পনেন্ট এ আর্গুমেন্টের সাহায্যে ডাটা পাঠানো যায় </td>
                            <td>State দিয়ে ডাটা পাঠানো যায় না</td>
                        </tr>
                        <tr>
                            <th scope="row">2</th>
                            <td>Immutable</td>
                            <td>Mutable</td>
                        </tr>
                        <tr>
                            <th scope="row">3</th>
                            <td>props কে চাইল্ড কম্পোনেন্টের সাহায্যে একসেস করা যায়</td>
                            <td>state কে চাইল্ড কম্পোনেন্ট থেকে একসেস করা যায় না</td>
                        </tr>
                        <tr>
                            <th scope="row">4</th>
                            <td>দুইটা কম্পোনেন্টের মধ্যে যোগাযোগ করতে ব্যাবহার করা হয়</td>
                            <td>কম্পোনেটেকে রেন্ডার করে ডাইনামিকভাবে চেঞ্জ করতে ব্যাবহার করা হয়।</td>
                        </tr>
                        <tr>
                            <th scope="row">5</th>
                            <td>কম্পোনেটেকে পূনরায় ব্যাবহার যোগ্য করে </td>
                            <td>কম্পোনেটেকে পূনরায় ব্যাবহার যোগ্য করে না </td>
                        </tr>
                        <tr>
                            <th scope="row">6</th>
                            <td>পরিবর্তন করা যায় না</td>
                            <td>Asynchronous ভাবে পরিবর্তন করা যায় </td>
                        </tr>
                    </tbody>
                </table>
                </div>
            </div>
        </div>
    );
};

export default QuesAns;